# $Id$
# Copyright (c) 2004 The Regents of the University of California. All
# Rights Reserved. Permission to use, copy, modify, and distribute this
# software and its documentation without fee, and without a written
# agreement is hereby granted, provided that the above copyright notice
# and this paragraph appear in all copies.  This software program and
# documentation are copyrighted by The Regents of the University of
# California. The software program and documentation are supplied "AS
# IS", without any accompanying services from The Regents. The Regents
# does not warrant that the operation of the program will be
# uninterrupted or error-free. The end-user understands that the program
# was developed for research purposes and is advised not to rely
# exclusively on the program for any reason.  IN NO EVENT SHALL THE
# UNIVERSITY OF CALIFORNIA BE LIABLE TO ANY PARTY FOR DIRECT, INDIRECT,
# SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES, INCLUDING LOST PROFITS,
# ARISING OUT OF THE USE OF THIS SOFTWARE AND ITS DOCUMENTATION, EVEN IF
# THE UNIVERSITY OF CALIFORNIA HAS BEEN ADVISED OF THE POSSIBILITY OF
# SUCH DAMAGE. THE UNIVERSITY OF CALIFORNIA SPECIFICALLY DISCLAIMS ANY
# WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
# MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE SOFTWARE
# PROVIDED HEREUNDER IS ON AN "AS IS" BASIS, AND THE UNIVERSITY OF
# CALIFORNIA HAS NO OBLIGATIONS TO PROVIDE MAINTENANCE, SUPPORT,
# UPDATES, ENHANCEMENTS, OR MODIFICATIONS.
#
# Keys in alphabetic order. 
# Don't sort the lines! That will probably make a mess since they values
# span several lines.
#
aboutbox.bugreport = \u041A\u0430\u043A \u0441\u043E\u043E\u0431\u0449\u0438\u0442\u044C \u043D\u0430\u043C \u043E\u0431 \u043E\u0448\u0438\u0431\u043A\u0435 \u0432 ArgoUML.\n\n\u041A\u0430\u043A \u0438 \u0432 \u0434\u0440\u0443\u0433\u0438\u0445 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F\u0445, \u043E\u0448\u0438\u0431\u043A\u0438 \u0435\u0441\u0442\u044C \u0438 \u0432 ArgoUML. \u041D\u0435\u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u0444\u0443\u043D\u043A\u0446\u0438\u0438 \u043C\u043E\u0433\u0443\u0442 \u0440\u0430\u0431\u043E\u0442\u0430\u0442\u044C \u043D\u0435\u043A\u043E\u0440\u0440\u0435\u043A\u0442\u043D\u043E \u0438\u043B\u0438 \u0434\u0435\u043C\u043E\u043D\u0441\u0442\u0440\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0441\u0442\u0440\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u0432\u0435\u0434\u0435\u043D\u0438\u0435. \u0427\u0430\u0441\u0442\u044C \u0438\u0437 \u044D\u0442\u0438\u0445 \u043E\u0448\u0438\u0431\u043E\u043A \u0438 \u043F\u0440\u043E\u0431\u043B\u0435\u043C \u043E\u043F\u0438\u0441\u0430\u043D\u044B \u0432 \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430\u0446\u0438\u0438.\n\n\u0427\u0442\u043E\u0431\u044B \u0443\u0431\u0435\u0434\u0438\u0442\u044C\u0441\u044F \u0432 \u0442\u043E\u043C, \u0447\u0442\u043E \u043F\u0440\u043E\u0431\u043B\u0435\u043C\u0430 \u0441 \u043A\u043E\u0442\u043E\u0440\u043E\u0439 \u0412\u044B \u0441\u0442\u043E\u043B\u043A\u043D\u0443\u043B\u0438\u0441\u044C \u043E\u043F\u0438\u0441\u0430\u043D\u0430 \u0432 \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430\u0446\u0438\u0438, \u043F\u0440\u043E\u0434\u0435\u043B\u0430\u0439\u0442\u0435 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0435\u0435:\n\n1.  \u041F\u043E\u0441\u0435\u0442\u0438\u0442\u0435 \u043D\u0430\u0448 \u0441\u0430\u0439\u0442 \u0432\u043E \u0432\u0441\u0435\u043C\u0438\u0440\u043D\u043E\u0439 \u043F\u0430\u0443\u0442\u0438\u043D\u0435 http://argouml.tigris.org.\n\n2.  \u0417\u0430\u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0438\u0440\u0443\u0439\u0442\u0435\u0441\u044C \u0442\u0430\u043C \u043A\u0430\u043A \u0443\u0447\u0430\u0441\u0442\u043D\u0438\u043A (member) \u043F\u0440\u043E\u0435\u043A\u0442\u0430 Tigris, \u0435\u0441\u043B\u0438 \u0412\u044B \u0435\u0449\u0451 \u043D\u0435 \u0441\u0434\u0435\u043B\u0430\u043B\u0438 \u044D\u0442\u043E\u0433\u043E.\n\n3.  \u0417\u0430\u043F\u0440\u043E\u0441\u0438\u0442\u0435 \u0440\u043E\u043B\u044C \u041D\u0430\u0431\u043B\u044E\u0434\u0430\u0442\u0435\u043B\u044F (observer) \u0432 \u043F\u0440\u043E\u0435\u043A\u0442\u0435 ArgoUml.\n\n4.  \u041F\u043E\u0439\u0434\u0438\u0442\u0435 \u043F\u043E \u0441\u0441\u044B\u043B\u043A\u0435 Issuezilla (\u041E\u0448\u0438\u0431\u043A\u0438 \u0438 \u043F\u0440\u043E\u0431\u043B\u0435\u043C\u044B - Bugs and Issues).\n\n5.  \u041F\u043E\u0438\u0449\u0438\u0442\u0435 \u043E\u0448\u0438\u0431\u043A\u0443 \u0432 \u043D\u0430\u0448\u0435\u0439 \u0431\u0430\u0437\u0435 \u0434\u0430\u043D\u043D\u044B\u0445.\n\n6.  \u0415\u0441\u043B\u0438 \u043F\u043E\u0438\u0441\u043A \u043F\u043E\u043A\u0430\u0436\u0435\u0442, \u0447\u0442\u043E \u043E\u043F\u0438\u0441\u0430\u043D\u0438\u0435 \u043E\u0448\u0438\u0431\u043A\u0438 \u0443\u0436\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442, \u0442\u043E \u0434\u043E\u0431\u0430\u0432\u044C\u0442\u0435 \u0441\u0435\u0431\u044F \u0432 \u043F\u043E\u043B\u0435 cc \u0432 \u043E\u043F\u0438\u0441\u0430\u043D\u0438\u0438 \u043F\u0440\u043E\u0431\u043B\u0435\u043C\u044B (Issue). \u041D\u0430 \u044D\u0442\u043E\u043C \u043F\u0440\u043E\u0446\u0435\u0441\u0441 \u0437\u0430\u043A\u0430\u043D\u0447\u0438\u0432\u0430\u0435\u0442\u0441\u044F. \u0415\u0441\u043B\u0438 \u0436\u0435 \u043F\u043E\u0438\u0441\u043A \u043F\u043E\u043A\u0430\u0436\u0435\u0442 \u043E\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u0438\u0435 \u0432 \u043D\u0430\u0448\u0435\u0439 \u0431\u0430\u0437\u0435 \u0434\u0430\u043D\u043D\u044B\u0445 \u043E\u043F\u0438\u0441\u0430\u043D\u0438\u044F \u043F\u0440\u043E\u0431\u043B\u0435\u043C\u043C\u044B \u043F\u043E\u0434\u043E\u0431\u043D\u043E\u0439 \u0442\u043E\u0439, \u0441 \u043A\u043E\u0442\u043E\u0440\u043E\u0439 \u0441\u0442\u043E\u043B\u043A\u043D\u0443\u043B\u0438\u0441\u044C \u0412\u044B, \u0442\u043E \u0412\u044B \u043C\u043E\u0436\u0435\u0442\u0435 \u0441\u043E\u0437\u0434\u0430\u0442\u044C \u043D\u043E\u0432\u043E\u0435 \u043E\u043F\u0438\u0441\u0430\u043D\u0438\u0435 \u043F\u0440\u043E\u0431\u043B\u0435\u043C\u044B (Issue).\n\n7.  \u041F\u0440\u0438 \u0441\u043E\u0437\u0434\u0430\u043D\u0438\u0438 \u043D\u043E\u0432\u043E\u0433\u043E \u043E\u043F\u0438\u0441\u0430\u043D\u0438\u044F \u043F\u0440\u043E\u0431\u043B\u0435\u043C\u044B \u0438\u043B\u0438 \u0434\u043E\u0431\u0430\u0432\u043B\u0435\u043D\u0438\u0438 \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u0438 \u0432 \u0443\u0436\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u044E\u0449\u0435\u0435, \u0443\u0431\u0435\u0434\u0438\u0442\u0435\u0441\u044C \u0432\u0442\u043E\u043C, \u0447\u0442\u043E \u0412\u044B \u0443\u043A\u0430\u0437\u0430\u043B\u0438:\n- \u0432\u0435\u0440\u0441\u0438\u044E \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F, \u043A\u043E\u0442\u043E\u0440\u0443\u044E \u0412\u044B \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0435,\n- \u0432\u0435\u0440\u0441\u0438\u044E \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u043C\u043E\u0433\u043E \u0412\u0430\u043C\u0438 jdk,\n- \u0432\u0441\u0435 \u043F\u0440\u0435\u0434\u0448\u0435\u0441\u0442\u0432\u0443\u044E\u0449\u0438\u0435 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u044B\u0435 \u0412\u0430\u043C\u0438 \u0448\u0430\u0433\u0438,\n- \u043E\u043F\u0438\u0441\u0430\u043D\u0438\u0435 \u0412\u0430\u0448\u0435\u0433\u043E \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u044C\u043D\u043E\u0433\u043E \u043F\u0440\u0438\u043C\u0435\u0440\u0430 (test case),\n- \u043A\u0430\u043A\u043E\u0439 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442 \u0412\u044B \u043E\u0436\u0438\u0434\u0430\u043B\u0438 \u0432 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u0435 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F \u044D\u0442\u043E\u0433\u043E \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u044C\u043D\u043E\u0433\u043E \u043F\u0440\u0438\u043C\u0435\u0440\u0430,\n- \u0447\u0442\u043E \u043F\u0440\u043E\u0438\u0437\u043E\u0448\u043B\u043E \u0432 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0442\u0435\u043B\u044C\u043D\u043E\u0441\u0442\u0438 \u0438 \u0432 \u0447\u0435\u043C, \u043A\u0430\u043A \u0412\u044B \u043F\u043E\u043B\u0430\u0433\u0430\u0435\u0442\u0435, \u0441\u043E\u0441\u0442\u043E\u0438\u0442 \u043F\u0440\u043E\u0431\u043B\u0435\u043C\u0430.\n\n8.  \u0415\u0441\u043B\u0438 \u043F\u0440\u043E\u0431\u043B\u0435\u043C\u0430 \u043F\u043E\u0432\u0442\u043E\u0440\u044F\u044E\u0449\u0430\u044F\u0441\u044F, \u0442\u043E \u043F\u0435\u0440\u0435\u0437\u0430\u043F\u0443\u0441\u0442\u0438\u0442\u0435 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0435 \u0441 \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043D\u043D\u0438\u0435\u043C \u0432\u0435\u0441\u0442\u0438 \u0436\u0443\u0440\u043D\u0430\u043B \u0432\u044B\u0432\u043E\u0434\u0430 \u043E\u0442\u043B\u0430\u0434\u043E\u0447\u043D\u044B\u0445 \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u0439.\n(java -Dlog4j.configuration=org/argouml/resource/full.lcf -jar argouml.jar)\n\u0438 \u043F\u043E\u0434\u043A\u043E\u043B\u0438\u0442\u0435 \u0444\u0430\u0439\u043B \u0436\u0443\u0440\u043D\u0430\u043B\u0430 argo_full.log \u043A \u043E\u043F\u0438\u0441\u0430\u043D\u0438\u044E \u043F\u0440\u043E\u0431\u043B\u0435\u043C\u044B.\n\n\n9. \u041F\u043E\u0434\u043A\u043E\u043B\u0438\u0442\u0435 \u043A \u043E\u043F\u0438\u0441\u0430\u043D\u0438\u044E \u043F\u0440\u043E\u0431\u043B\u0435\u043C\u044B \u0434\u043E\u043F\u043E\u043B\u043D\u0438\u0442\u0435\u043B\u044C\u043D\u0443\u044E \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044E, \u043A\u043E\u0442\u043E\u0440\u0430\u044F \u043C\u043E\u0436\u0435\u0442 \u0438\u043C\u0435\u0442\u044C \u043A \u043D\u0435\u043C\u0443 \u043E\u0442\u043D\u043E\u0448\u0435\u043D\u0438\u0435. \u042D\u0442\u043E \u043C\u043E\u0433\u0443\u0442 \u0431\u044B\u0442\u044C \u0441\u043D\u0438\u043C\u043A\u0438 \u044D\u043A\u0440\u0430\u043D\u0430, \u0444\u0430\u0439\u043B\u044B \u0412\u0430\u0448\u0438\u0445 \u043F\u0440\u043E\u0435\u043A\u0442\u043E\u0432, \u0444\u0430\u0439\u043B\u044B \u0436\u0443\u0440\u043D\u0430\u043B\u043E\u0432...\n\n10. \u0412\u044B \u0431\u0443\u0434\u0435\u0442\u0435 \u043F\u043E\u043B\u0443\u0447\u0430\u0442\u044C \u0438\u0437\u0432\u0435\u0449\u0435\u043D\u0438\u044F \u043F\u043E \u044D\u043B\u0435\u043A\u0442\u0440\u043E\u043D\u043D\u043E\u0439 \u043F\u043E\u0447\u0442\u0435 \u0432\u043E \u0432\u0441\u0435\u0445 \u0441\u043B\u0443\u0447\u0430\u044F\u0445, \u043A\u043E\u0433\u0434\u0430 \u0434\u0440\u0443\u0433\u0438\u0435 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u0438 \u0438\u043B\u0438 \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u0447\u0438\u043A\u0438 \u0431\u0443\u0434\u0443\u0442 \u043A\u043E\u043C\u043C\u0435\u043D\u0442\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0438\u043B\u0438 \u0432\u044B\u043F\u043E\u043B\u043D\u044F\u0442\u044C \u0438\u043D\u044B\u0435 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044F \u0441 \u0412\u0430\u0448\u0438\u043C \u043E\u043F\u0438\u0441\u0430\u043D\u0438\u0435\u043C \u043F\u0440\u043E\u0431\u043B\u0435\u043C\u044B.\n\n11.\u041A\u043E\u0433\u0434\u0430 \u043F\u0440\u043E\u0431\u043B\u0435\u043C\u0430 \u0431\u0443\u0434\u0435\u0442 \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043D\u0430, \u0438 \u044D\u0442\u043E \u0431\u0443\u0434\u0435\u0442 \u043F\u043E\u0434\u0442\u0432\u0435\u0440\u0436\u0434\u0435\u043D\u043E \u0434\u0440\u0443\u0433\u0438\u043C\u0438 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F\u043C\u0438, \u0437\u0430\u043A\u0440\u043E\u0439\u0442\u0435 \u0412\u0430\u0448\u0435 \u043E\u043F\u0438\u0441\u0430\u043D\u0438\u0435 \u043F\u0440\u043E\u0431\u043B\u0435\u043C\u044B \u0432 \u0442\u043E\u043C \u0441\u043B\u0443\u0447\u0430\u0435, \u0435\u0441\u043B\u0438 \u0412\u0430\u0441 \u0443\u0441\u0442\u0440\u0430\u0438\u0432\u0430\u0435\u0442 \u0442\u0430\u043A\u043E\u0435 \u0440\u0435\u0448\u0435\u043D\u0438\u0435 \u043F\u0440\u043E\u0431\u043B\u0435\u043C\u044B.\n\n\u0421\u043B\u0435\u0434\u0443\u044F \u043E\u043F\u0438\u0441\u0430\u043D\u043D\u044B\u043C \u0432\u044B\u0448\u0435 \u0448\u0430\u0433\u0430\u043C, \u0412\u044B \u0432\u043D\u0435\u0441\u0451\u0442\u0435 \u0432\u0430\u0436\u043D\u044B\u0439 \u0432\u043A\u043B\u0430\u0434 \u0432 \u043F\u0440\u043E\u0435\u043A\u0442 ArgoUML \u043F\u0440\u0435\u0434\u043E\u0441\u0442\u0430\u0432\u0438\u0432 \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044E, \u043A\u043E\u0442\u043E\u0440\u0430\u044F \u043F\u043E\u043C\u043E\u0436\u0435\u0442 \u043D\u0430\u043C \u0443\u043B\u0443\u0447\u0448\u0438\u0442\u044C \u043D\u0430\u0448 \u043F\u0440\u043E\u0434\u0443\u043A\u0442.


aboutbox.contacts = \u0414\u043B\u044F \u043F\u043E\u043B\u0443\u0447\u0435\u043D\u0438\u044F \u0431\u043E\u043B\u0435\u0435 \u0434\u0435\u0442\u0430\u043B\u044C\u043D\u043E\u0439 \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u0438 \u043E \u043F\u0440\u043E\u0435\u043A\u0442\u0435 ArgoUML:\n\n+ \u041F\u043E\u0441\u0435\u0442\u0438\u0442\u0435 \u043D\u0430\u0448 \u0441\u0430\u0439\u0442 \u0432\u043E \u0432\u0441\u0435\u043C\u0438\u0440\u043D\u043E\u0439 \u043F\u0430\u0443\u0442\u0438\u043D\u0435:\nhttp://argouml.tigris.org\n\n+ \u041F\u043E\u0448\u043B\u0438\u0442\u0435 \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u0435 \u0432 \u0441\u043F\u0438\u0441\u043E\u043A \u0440\u0430\u0441\u0441\u044B\u043B\u043A\u0438 \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u0447\u0438\u043A\u043E\u0432:\ndev@argouml.tigris.org\n(\u0441\u043D\u0430\u0447\u0430\u043B\u0430 \u043F\u043E\u0434\u043F\u0438\u0448\u0438\u0442\u0435\u0441\u044C \u043D\u0430 \u0441\u043F\u0438\u0441\u043E\u043A \u0440\u0430\u0441\u0441\u044B\u043B\u043A\u0438, \u043F\u043E\u0441\u043B\u0430\u0432 \u0441\u043E\u043E\u0431\u0449\u0435\u043D\u0438\u0435 \u043F\u043E \u0430\u0434\u0440\u0435\u0441\u0443 dev-subscribe@argouml.tigris.org)

aboutbox.credits = \u0420\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u0447\u0438\u043A\u0438 ArgoUML:\n\n\u041B\u0438\u0434\u0435\u0440 \u043F\u0440\u043E\u0435\u043A\u0442\u0430:\nLinus Tolke (linus@tigris.org)\n\n\u0412\u043B\u0430\u0434\u0435\u043B\u044C\u0446\u044B \u043C\u043E\u0434\u0443\u043B\u0435\u0439 (\u0441\u0432\u044F\u0436\u0438\u0442\u0435\u0441\u044C \u0441 \u044D\u0442\u0438\u043C\u0438 \u043B\u044E\u0434\u044C\u043C\u0438, \u0435\u0441\u043B\u0438 \u0412\u044B \u0436\u0435\u043B\u0430\u0435\u0442\u0435 \u0432\u043D\u0435\u0441\u0442\u0438 \u0441\u0432\u043E\u0439 \u043F\u043E\u0441\u0438\u043B\u044C\u043D\u044B\u0439 \u0432\u043A\u043B\u0430\u0434):\n\u041F\u043E\u0434\u0434\u0435\u0440\u0436\u043A\u0430 plugin-\u043C\u043E\u0434\u0443\u043B\u0435\u0439, \u043F\u0440\u043E\u0446\u0435\u0441\u0441 \u0441\u0431\u043E\u0440\u043A\u0438: Thierry Lach (thierry_lach@hotmail.com)\n\u0418\u0442\u0435\u0440\u0430\u0442\u0438\u0432\u043D\u043E\u0435 \u043F\u0440\u043E\u0435\u043A\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435: Thomas Neustupny (thn-d@gmx.de)\n\u0420\u0443\u043A\u043E\u0432\u043E\u0434\u0441\u0442\u0432\u043E \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F: Jeremy Bennett (jeremybennett@tigris.org)\n\u0418\u043D\u0442\u0435\u0440\u043D\u0430\u0446\u0438\u043E\u043D\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u044F: Jean-Hugues de Raigniac (jhraigniac@tigris.org)\n\u0427\u0430\u0441\u0442\u043E \u043F\u043E\u0432\u0442\u043E\u0440\u044F\u044E\u0449\u0438\u0435\u0441\u044F \u0432\u043E\u043F\u0440\u043E\u0441\u044B: Ewan R. Grantham\n\u0412\u044B\u043F\u0443\u0441\u043A\u0430\u044E\u0449\u0438\u0439 \u043C\u0435\u043D\u0435\u0434\u0436\u0435\u0440: Linus Tolke\n\n\u0420\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u0447\u0438\u043A\u0438, \u0432\u043D\u0435\u0441\u0448\u0438\u0435 \u0432\u043A\u043B\u0430\u0434 \u0432 \u0432\u0435\u0440\u0441\u0438\u0438 \u0434\u043E 0.13.*:\n\nMarkus Klink\nJaap Branderhorst\nThierry Lach\nBob Tarling\nLinus Tolke\nJason Robbins\nMichael Stockman\nThomas Neustupny\nJean-Hugues de Raigniac\nAlex Bagehot\nSteffen Zschaler\nAlexander Lepekhine\n\n\u0411\u044B\u0432\u0448\u0438\u0435 \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u0447\u0438\u043A\u0438:\n\n\u0418\u0441\u0441\u043B\u0435\u0434\u043E\u0432\u0430\u0442\u0435\u043B\u0438:  \nJason Robbins (\u041E\u0441\u043D\u043E\u0432\u0430\u0442\u0435\u043B\u044C \u043F\u0440\u043E\u0435\u043A\u0442\u0430)\nDavid Redmiles\nDavid Hilbert\n\n\u0420\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u0447\u0438\u043A\u0438 \u0438 \u0442\u0435\u0441\u0442\u0438\u0440\u043E\u0432\u0449\u0438\u043A\u0438:  \nJason Robbins\nAdam Gauthier\nAdam Bonner\nDavid Hilbert\nICS 125 team Spring 1996\nICS 125 teams Spring 1998\n\n(\u0432 \u0430\u043B\u0444\u0430\u0432\u0438\u0442\u043D\u043E\u043C \u043F\u043E\u0440\u044F\u0434\u043A\u0435):\n\nAlexey Aphanasyev\nAndreas Rueckert (a_rueckert@gmx.net) (Java RE)\nClemens Eichler\nCurt Arnold\nDavid Glaser\nDennis Daniels (denny_d@hotmail.com)\nDonat Wullschleger\nEdwin Park\nEric Lefevre\nEugenio Alvarez\nFrank Finger\nFrank Wienberg\nGrzegorz Prokopski\nJim Holt\nLuc Maisonobe\nMarcus Andersson\nMarko Boger (GentleWare) (UML \u0434\u0438\u0430\u0433\u0440\u0430\u043C\u043C\u044B)\nNick Santucci\nPhil Sager\nPhilippe Vanpeperstraete (Philippe.Vanpeperstraete@skynet.be) (\u0420\u0443\u043A\u043E\u0432\u043E\u0434\u0441\u0442\u0432\u043E \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F)\nPiotr Kaminski\nScott Guyer\nSean Chen\nSteve Poole\nStuart Zakon\nThomas Schaumburg\nThorsten Sturm (thorsten.sturm@gentleware.de) (GEF)\nToby Baier (Toby.Baier@gmx.net) (UML \u043C\u0435\u0442\u0430\u043C\u043E\u0434\u0435\u043B\u044Cl, XMI, \u043B\u0438\u0434\u0435\u0440 \u043F\u0440\u043E\u0435\u043A\u0442\u0430)\nWill Howery\n

aboutbox.legal = Copyright (c) 1996-2004 The Regents of the University of California.\nAll Rights Reserved.  Permission to use, copy, modify, and distribute this software and its documentation without fee, and without a written agreement is hereby granted, provided that the above copyright notice and this paragraph appear in all copies.  This software program and documentation are copyrighted by The Regents of the University of California.  The software program and documentation are supplied ''as is'', without any accompanying services from The Regents.  The Regents do not warrant that the operation of the program will be uninterrupted or error-free.  The end-user understands that the program wasdeveloped for research purposes and is advised not to rely exclusively on the program for any reason.  \nIN NO EVENT SHALL THE UNIVERSITY OFCALIFORNIA BE LIABLE TO ANY PARTY FOR DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES, INCLUDING LOST PROFITS, ARISINGOUT OF THE USE OF THIS SOFTWARE AND ITS DOCUMENTATION, EVEN IF THEUNIVERSITY OF CALIFORNIA HAS BEEN ADVISED OF THE POSSIBILITY OF SUCHDAMAGE.  THE UNIVERSITY OF CALIFORNIA SPECIFICALLY DISCLAIMS ANYWARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OFMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.  THE SOFTWAREPROVIDED HEREUNDER IS ON AN ''AS IS'' BASIS, AND THE UNIVERSITY OFCALIFORNIA HAS NO OBLIGATIONS TO PROVIDE MAINTENANCE, SUPPORT,UPDATES, ENHANCEMENTS, OR MODIFICATIONS.

aboutbox.aboutbox-title=\u041A\u043E\u0440\u043E\u0442\u043A\u043E \u043E\u0431 ArgoUML

aboutbox.generated-version-header=\n--- \u0410\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0438 \u0441\u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u0430\u044F \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044F: ---\n

aboutbox.thanks=\u0420\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u0447\u0438\u043A\u0438 ArgoUML \u0445\u043E\u0442\u0435\u043B\u0438 \u0431\u044B \u043F\u043E\u0431\u043B\u0430\u0433\u043E\u0434\u0430\u0440\u0438\u0442\u044C \u0432\u0441\u0435\u0445 \u0442\u0435\u0445 \u0448\u0438\u0440\u043E\u043A\u043E \u043C\u044B\u0441\u043B\u044F\u0449\u0438\u0445 \u043B\u044E\u0434\u0435\u0439, \u043A\u0442\u043E \u0442\u0440\u0430\u0442\u0438\u043B \u0441\u0432\u043E\u0435 \u043D\u0435\u043E\u0446\u0435\u043D\u0438\u0435\u043C\u043E\u0435 \u0432\u0440\u0435\u043C\u044F \u0434\u0435\u043B\u0430\u044F \u0432\u043A\u043B\u0430\u0434 \u0432 \u043F\u0440\u043E\u0435\u043A\u0442 ArgoUML.  \u0411\u0435\u0437 \u0412\u0430\u0448\u0435\u0439 \u0440\u0430\u0431\u043E\u0442\u044B \u043C\u044B \u0431\u044B \u043D\u0435 \u0434\u043E\u0441\u0442\u0438\u0433\u043B\u0438 \u0442\u0435\u043F\u0435\u0440\u0435\u0448\u043D\u0435\u0433\u043E \u0441\u043E\u0441\u0442\u043E\u044F\u043D\u0438\u044F \u043F\u0440\u043E\u0435\u043A\u0442\u0430!\n

aboutbox.used-tools-header=\n\u0418\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u044B \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u0438\u043D\u0441\u0442\u0440\u0443\u043C\u0435\u043D\u0442\u044B:\n
